import CardInfo from "../ui/card-info";

export default function Info() {
  const infoCards = [
    {
      image: "/one.png",
      title: "Індивідуальний підхід",
      description:
        "Не кожен, хто планує створення власного сайту, до кінця розуміє його мету. Саме визначення цілей проєкту впливає на подальше просування та ефективність ресурсу. Основні цілі створення сайту поділяються на два напрями: взаємодія та реклама. Сайт дозволяє налагодити комунікацію з клієнтами, обмінюватися інформацією та водночас слугує інструментом для представлення компанії, її товарів або послуг незалежно від місця перебування користувача.",
    },
    {
      image: "/one.png",
      title: "Роль програмного забезпечення",
      description:
        "Програмне забезпечення є інструментом для вирішення конкретних завдань. Веб-додатки використовуються для обліку робочого часу, нарахування заробітної плати, контролю процесів у компаніях та установах. ПЗ застосовується не лише в бізнесі, а й у некомерційній сфері. Прикладом є електронні шкільні щоденники, що забезпечують взаємодію між школою, учнями та батьками, а також онлайн-замовлення, зворотний зв’язок і публікація інформації.",
    },
    {
      image: "/one.png",
      title: "Підхід до веб-розробки",
      description:
        "Веб-розробка починається з визначення цілей і потреб клієнта. Тип і обсяг інформації впливають на вигляд сайту, вибір платформи та необхідний функціонал, а також на складність реалізації. Коректно виконана робота — це відповідність поставленим завданням, функціональність ресурсу та задоволення потреб користувачів.",
    },
  ];
  return (
    <div className="mt-[5em]">
      <h2 className="text-5xl font-bold my-8 text-center">Основні аспекти</h2>
      {infoCards.map((card, index) => (
        <CardInfo
          key={index}
          image={card.image}
          title={card.title}
          description={card.description}
        />
      ))}
    </div>
  );
}
